Cover_letter_app/app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@gmail.com"], ["LIMIT", 1]]
---
  def login
    user_par = params[:user]
    user = User.find_by_email(user_par[:email])