Cover_letter_app/app/controllers/api/educations_controller.rb

SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def resume_id
    Resume.find(params[:resume_id])

INSERT INTO "educations" ("institution", "qualification", "desc", "resume_id", "year") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["institution", "project12"], ["qualification", "dur2"], ["desc", "test2"], ["resume_id", 1], ["year", 2020]]
---
  def create
    render json: resume_id.educations.create(education_params)