Cover_letter_app/app/controllers/api/experiences_controller.rb

  def resume_id
    Resume.find(params[:resume_id])
---
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    render json: resume_id.experiences.all
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."resume_id" = $1  [["resume_id", 1]]

  def create
    render json: resume_id.experiences.create(experience_params)
---
INSERT INTO "experiences" ("organisation", "position", "duration", "desc", "resume_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["organisation", "project1"], ["position", "here is link"], ["duration", "dur"], ["desc", "test"], ["resume_id", 1]]