Cover_letter_app/app/controllers/api/projects_controller.rb

  def resume_id
    Resume.find(params[:resume_id])
---
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    render json: resume_id.projects.create(project_params)
---
INSERT INTO "projects" ("title", "link", "desc", "resume_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "project1"], ["link", "here is link"], ["desc", "test"], ["resume_id", 1]]