Cover_letter_app/app/controllers/api/resumes_controller.rb

SELECT "resumes".* FROM "resumes" WHERE "resumes"."user_id" = $1  [["user_id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def index
    render json: User.find(@user_id).resumes.all

INSERT INTO "resumes" ("name", "phone", "linkedin", "github", "skills", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "r"], ["phone", 0], ["linkedin", "r"], ["github", "r"], ["skills", "r"], ["user_id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def create
    render json: User.find(@user_id).resumes.create(resume_params)