Cover_letter_app/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    user = User.find(@user_id)

SELECT "users".* FROM "users"
---
  def show
    render json: User.all

INSERT INTO "users" ("name", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["name", "user2"], ["email", "useqewq@gmail.com"], ["password_digest", "$2a$12$gIMsS6jiwwyQPDR52Cy6B.zPK.G0z9vcXzujDhQ6QJEldk99SOdwe"]]
---
  def create
    user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "updateduser"], ["email", "new@gmail.com"], ["id", 4]]
---
  def update
    render json: User.find(@user_id).update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    email = User.find_by_id(params[:id])
    User.destroy(params[:id])